docs/blog/posts/oblivious_data_structues.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-22 Sun 20:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A C++ Library for Oblivious Data Structures</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">A C++ Library for Oblivious Data Structures</h1>
<div id="outline-container-org280da6d" class="outline-2">
<h2 id="org280da6d">Motivation</h2>
<div class="outline-text-2" id="text-org280da6d">
<p>
Increase in cloud computing, but we don't trust the cloud. 
</p>

<p>
Obviously, there is no motivation for cloud providers to offer consumers protection from themselves &#x2013; even if they are uninterested in client data, the additional protections would result in huge slowdowns and cost increases to their services, making them less attractive to consumers.
</p>

<p>
Luckily, academics have shown that they are interested in working on technologies to secure the public cloud; secure computing on untrusted hardware is a thriving branch of security research.
Emerging technologies such as TEEs (trusted execution environments), FHE (fully homomorphic encryption), and MPC (multi-party computation) enable users to write code which can be executed on an untrusted server to produce a result that is guaranteed to be secret and/or correct. 
While these technologies come at a high cost (TEEs) or high computational overhead (FHE, MPC), they have shown promise for smaller scale computations, and in certain specialized computations (i.e., model training) after task-specific optimization.
</p>

<p>
ORAM (oblivious random access memory) is a system level technique which aims to hide memory access patterns and data from an observer able to snoop on the memory device itself. 
ORAM can be used as a standalone protection or in conjunction with other technologies that protect the computation occurring on the accessed data.
Unfortunately, state of the art ORAM schemes introduce high overhead &#x2013; typically requiring a large number of standard memory reads and writes per oblvious memory operation, adding an overhead that for most developers is unacceptable. 
</p>

<p>
This overhead can be removed in specific scenarios, but real-world implementations of such efficient, special-purpose ORAMs are not publicly or easily available. For this project, we aim to solve this with an implementation of multiple "oblivious data structures".
</p>
</div>
</div>
<div id="outline-container-orgda87952" class="outline-2">
<h2 id="orgda87952">Background</h2>
<div class="outline-text-2" id="text-orgda87952">
</div>
<div id="outline-container-org05f7b4a" class="outline-3">
<h3 id="org05f7b4a">Secure Program Execution</h3>
<div class="outline-text-3" id="text-org05f7b4a">
<p>
When considering how to define secure program execution, there are many facets to consider: compute, memory, network devices, etc. all have the ability to leak different, potentially sensitive information. Since it is difficult to consider all facets of secure execution at once, researchers segment security definitions to deal with the specific ways in which data could be leaked as individual security guarantees.
</p>

<p>
In order for the execution of a program to be \textit{memory-trace oblivious}, an adversary observing the memory accesses must not be able to discern any information about sensitive program inputs or outputs (which may or may not include the program). 
This is important, as through memory access patterns, an adversary may be able to use techniques such as frequency analysis, co-occurrence analysis, or read-write distinguishability to reveal information about program inputs based on dependent control flow.
</p>
</div>
</div>
<div id="outline-container-org45783a4" class="outline-3">
<h3 id="org45783a4">ORAM</h3>
<div class="outline-text-3" id="text-org45783a4">
<p>
ORAM is a system and/or compiler level technique to translate programs into a memory-trace oblivious form. 
Almost all ORAM designs share the same core ideas for hiding data. When blocks are accessed, they are shuffled an remapped, so repeated accesses to the same data point will appear to be targeting a sequence of different, random memory locations. Data is also "over-fetched", meaning not all retrieved blocks contain useful data. This prevents an adversary from identifying which of several blocks is of use to the client. 
</p>

<p>
ORAM is an active field of research, with many variants published, each optimized for slightly different use cases and implemented in slightly different ways. Some popular variants include path ORAM, circuit ORAM, and ring ORAM.
</p>

<p>
Our project uses a non-recursive path ORAM\cite{stefanov2018path} as the basis of our implementation.
Figure \ref{fig:path-oram} shows an example of a path ORAM data structure with 4 levels (\(L = 4\)). The structure has \(2^L\) unique "paths" from root to leaf, with each path being identifiable by the index of the leaf node at which it terminates. 
Blocks of memory are placed into buckets located at nodes along the path their address is currently mapped to, with mappings stored either in a single lookup table, or a smaller, recursive set of path ORAMs (the size of the mapping table can be significant as the number of blocks becomes large). 
Non-leaf nodes may contain blocks from any path which intersects them.
</p>

<p>
When a block is read or written, \textit{all} blocks on the associated path are read from the path ORAM tree into the stash (a client side cache for ORAM blocks). The block data is then unencrypted, and the stored address tag is compared with the target address. The found block is then read/written as normal, and the address is remapped to a new, random leaf node. Once the operation is completed, blocks from the stash are written back if there is available bucket space on the path, starting from the leaf node and ending with the root bucket. The specific mapping and ordering of blocks will occasionally result in the stash not being fully empty after this step, and any remaining blocks will persist until the next write-back able to clear them.
</p>

<p>
Despite being well studied, all existing ORAMs share a few key problems.
The first is the large mapping store. One motivation for the use of ORAM is a large amount of data that cannot fit on a small, trusted client's storage, so if follows that we do not have a large amount of storage to waste on a mapping table.
The current technique for resolving the client-side storage overhead is a recursive path ORAM, which stores a small mapping table on the client used to lookup increasingly more granular mapping tables from the ORAM server. This recursive process introduces extra overhead in terms of communication bandwidth and computation.
Unfortunately, current research has been unable to alleviate this problem in the general case. However, most programs do not require massive amounts of random access memory. This is because large data is typically organized by data structures designed for efficient access. Prior works\cite{wang2014oblivious} have shown that in this special case, the mapping lookup overhead can be almost \textit{entirely} eliminated on the client side.
</p>
</div>
</div>
<div id="outline-container-orgc330bc9" class="outline-3">
<h3 id="orgc330bc9">Oblivious Data Structures</h3>
<div class="outline-text-3" id="text-orgc330bc9">
<p>
A small number of prior works specifically target oblivious data structures, which are data structures built on top of secure technologies such as MPC or ORAM.
Our work is based on the pointer-based ORAM oblivious data structures described by \cite{wang2014oblivious} due to the simplicity and extensibility of its design.
The core idea of the work is that data structures restrict what memory locations can be accessed at any point to a small number of addresses, and therefore only a small number of mappings must be known at any point. The author's suggest adding metadata to each oram block indicating the revealed accessible addresses and their leaf mappings. The ORAM client itself also stores a small number of pointers (i.e., for an oblivious stack, the top pointer and mapping).
The paper also proposes a locality based strategy for implementing efficient oblivious graph algorithms, but we do not implement this in our project.
</p>
</div>
</div>
</div>
