docs/blog/posts/oblivious_data_structues.html
<div id="outline-container-org6030229" class="outline-2">
<h2 id="org6030229">How it Works</h2>
<div class="outline-text-2" id="text-org6030229">
</div>
<div id="outline-container-org7968478" class="outline-3">
<h3 id="org7968478">Client Server Model</h3>
<div class="outline-text-3" id="text-org7968478">
<p>
Our design is based on a client server ORAM model, where communication occurs using serialized command structures over a TCP stream. The client initiates path reads or path write-backs, and then sends or receives a fixed number of encrypted ORAM blocks based on the path ORAM parameters. For example, a tree with \(L = 4\) levels and \(Z = 8\) blocks per node bucket would read/write \(4 \cdot 8 = 32\) blocks. The buckets are initialized to contain encrypted "empty" blocks, which are replaced during execution with real blocks as the data structure is populated.
</p>
</div>
</div>
<div id="outline-container-orgb035c8a" class="outline-3">
<h3 id="orgb035c8a">Data Structures</h3>
<div class="outline-text-3" id="text-orgb035c8a">
</div>
<div id="outline-container-org2b4e2d6" class="outline-4">
<h4 id="org2b4e2d6">Oblivious Stack</h4>
<div class="outline-text-4" id="text-org2b4e2d6">
<p>
Figure \ref{fig:stack} shows an oblivious stack data structure. Like in traditional path ORAM, each block has an associated address mapped to a certain leaf index. Unlike traditional path ORAM, the client ORAM only has access to a single one of these mappings: it stores the top pointer and the associated leaf index. 
</p>

<p>
When pushing to the stack, the new top block is assigned an address based on an internal counter variable (i.e., the \(i^{th}\) block has address \(i\)). This counter can also be used to return the current size of the stack. The new block's address is randomly mapped to a leaf index. Alongside the block data, and address, the block also stores a pointer to the previous stack top (the address and leaf index) as metadata. These allow backtracking through blocks as they are removed from the stack.
</p>

<p>
When popping from the stack, the client side metadata is used to lookup the top block from server as in standard non-recursive path ORAM. Then, the client metadata is replaced with the fetched blocks metadata, which is a pointer to the block just below it on the stack. This new top block can then be popped in an identical fashion.
</p>
</div>
</div>
<div id="outline-container-org549481f" class="outline-4">
<h4 id="org549481f">Oblivious Queue</h4>
<div class="outline-text-4" id="text-org549481f">
<p>
Figure \ref{fig:queue} shows an oblivious queue data structure. The queue client stores two ORAM pointers: one to the queue head and the other to the queue tail. These can be used to push and pop values to/from the queue similarly to the stack client. However, the queue requires a small modification to the push methodology.
</p>

<p>
When removing blocks from the queue, we would then like to point the head to the ORAM block that was pushed \textit{after} the block that was just removed. This means we need to include metadata in the block when we write it pointing to another block which \textit{does not yet exits}. We solve this problem by pre-generating an address and leaf index for the next block, which we store on the client side. Then, when the following push request is received from the user, the client is able to create a new block at the existing ORAM pointer, which will then be retrievable after popping the previous block. This "ghost block" technique is shown in figure \ref{fig:queue}.
</p>
</div>
</div>
<div id="outline-container-org7f4ca94" class="outline-4">
<h4 id="org7f4ca94">Oblivious AVL Tree (Map/Set)</h4>
<div class="outline-text-4" id="text-org7f4ca94">
<p>
Figure \ref{fig:avl} shows an oblivious AVL tree, which is the basis of our oblivious map and oblivious set data structures. This follows from the C++ implementation of \code{std::map} and \code{std::set} which use the AVL tree for guaranteed fast look-ups.
</p>

<p>
We store the root node's address and leaf index in the AVL tree-based clients. Each ORAM block is a node in the tree, and contains as metadata pointers to its child blocks. When looking up an item in the map or set, we always start at the root and search downwards, at each step using the appropriate (left vs. right) child pointer found in the current block based on the comparison function provided.
</p>

<p>
When inserting an item, we traverse the tree similarly and then perform any re-balancing operations as we would in a traditional AVL tree. 
We introduce some optimizations during our implementation phase which help reduce the number of client-server interactions necessary for these operations, which require multiple block accesses with high temporal locality.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf64f2af" class="outline-2">
<h2 id="orgf64f2af">Implementation</h2>
<div class="outline-text-2" id="text-orgf64f2af">
<p>
We implement our library in \(\approx1500\) lines of C++.
</p>

<p>
The implementation contains two base classes: \code{ORAMClient} and \code{ORAMServer}. These classes communicate via a bidirectional TCP stream.
Communication uses a serialized \code{Cmd} structure containing an opcode, an (optional) encrypted ORAM block, and an (optional) leaf index. 
The \code{Cmd} has one of three opcodes: 
</p>
\begin{itemize}
    \item \code{GET\_BLOCKS}: Used by the client to initiate a read of blocks from a certain path of the ORAM. When sending this opcode the \code{Cmd} must include a valid \code{leaf\_idx}.
    \item \code{DUMP\_STASH}: Used by the client to initiate a writeback of blocks to a certain path of the ORAM. When sending this opcode the \code{Cmd} must include a valid \code{leaf\_idx}.
    \item \code{BLOCKS}: Used once another command has been initiated to send a single ORAM block between the client and server.
\end{itemize}
<p>
Within our client code, a \code{GET\_BLOCKS} sequence is always followed by a \code{DUMP\_STASH} operation which allows us to keep the number of blocks on a path constant despite the fixed number of blocks transmitted during each operation. Encrypted empty blocks are used to pad the path buckets when no "real" blocks with a suitable leaf index exist in the stash.
</p>

<p>
Future work could reduce communication overhead by having different \code{Cmd} structures based on which fields are required by the opcode to reduce the amount of null data transferred. 
</p>

<p>
Each of the oblivious data structures described in this paper are implemented as classes which extend \code{ORAMClient}. They expose public functions comparable to the C++ implementations of the same data structures. All TCP communication and intermediate read/write optimizations occur in the background, hidden from a user.
</p>

<p>
The encryption and decryption of block data uses an AES implementation from the OpenSSL\cite{openssl} cryptography library. We operate on the entire ORAM block structure (including metadata), and send the fully encrypted blob to the server.
</p>
</div>
<div id="outline-container-org8de858f" class="outline-3">
<h3 id="org8de858f">Optimizations</h3>
<div class="outline-text-3" id="text-org8de858f">
<p>
We introduce two optimizations during our implementation phase. 
The first is delayed writes. For stack/queue push operations, and AVL tree insertion, we know that the block at the address we'd like to write to does not yet exist on the server. Therefore, there is no need for us to communicate with the server. Instead, we create a new block locally and place it into the stash. It will then eventually be propagated to the server when an operation necessitating a write-back does occur.
To ensure this technique does not result in an overfilled stash, we introduce a threshold value. Once there are \code{THRESHOLD} number of blocks in the stash, the client triggers a \code{GET\_BLOCKS/DUMP\_STASH} command pairing to a randomly chosen leaf index, effectively draining the stash to prevent overflow.
</p>

<p>
The second optimization is the introduction of an \code{in\_use} flag for blocks in the stash. When an ORAM block is retrieved for the first time from the server or accessed from the stash the flag is set to indicate that it should not be evicted from the stash during a write-back. The function using the block is then responsible for un-setting the flag once the block is no longer needed. The usage of this flag is entirely transparent to the user, and does not introduce any programming overhead.
</p>
</div>
</div>
