docs/blog/posts/oblivious_data_structues.html
<div id="outline-container-org926fcec" class="outline-3">
<h3 id="org926fcec">Security Analysis</h3>
<div class="outline-text-3" id="text-org926fcec">
<p>
Our implementation is based on prior works\cite{wang2014oblivious, stefanov2018path} which provide an in-depth security analysis of the pointer based method. We briefly discuss the security of our practical implementation decisions here.
</p>

<p>
Block data and metadata is encrypted using the AES symmetric cipher, which is considered to be secure. We include a nonce in the blocks that is incremented before encryption to prevent the server from knowing which blocks on a path were/were not read/written since their last tenancy on the server. We also initialize the \texttt{data} field empty blocks to random bytes to prevent them from being identifiable by the server when encrypted.
</p>

<p>
The server also has minimal knowledge about the usage of the data structure. To begin, we do not explicitly inform the server which of the implemented data structures our client is. Any access to the server is done through the base \texttt{ORAMClient} class and provides only an opcode, an encrypted block, and a leaf index.
The server cannot tell if an access is a read or write since all blocks will appear changed when written back due to the nonce.
</p>

<p>
The delayed write mechanism in conjunction with random stash flushes helps hide operations that could potentially reveal the identity of the data structure or the usage (reads vs. writes). 
Consider the case in which a client continuously pushes to a stack, and then continuously pops from the stack. In this case, the leaf indices seen by the server would appear symmetric, allowing the server to guess the access pattern.
By caching writes on the client and then randomly choosing a path to fill to, we make access patterns appear more random and prevent such information leakage.
</p>

<p>
There is some information leakage in terms of read/write timing and the overall number of accesses, but this has not been solved by previous ORAM works, and therefore we do not attempt to address it.
</p>
</div>
</div>
</div>
<div id="outline-container-org176db64" class="outline-2">
<h2 id="org176db64">Limitations</h2>
<div class="outline-text-2" id="text-org176db64">
<p>
Due to the short time-frame, our library has many limitations. First, the exposed APIs eliminate the possibility of random-access to data, essentially "locking" the information into the data structures. That is, data can only be accessed \textit{if} it is in a position referenceable under correct usage of the data structure. This prevents us from providing certain utility functions included in the C++ equivalent implementations, such as the ability to peek at data in the middle of a stack. To solve this, our ORAM client/server interface could be extended to provide recursive lookup functionality when necessary based on the Path ORAM\cite{stefanov2018path} design.
</p>

<p>
Our implementation is also designed for data structures which store large amounts of data per-node of the data structure in use. This is because we treat each ORAM block on the path as a single data structure node (i.e., stack item, AVL tree node), meaning that if the data stored per entry is small the per-byte read/write costs cannot be amortized well. One possible solution to this is structure packing: a single ORAM block could contain multiple entries of a structure. This segmented design is more difficult to implement, but would likely be much more practical for most use cases, and would allow much more efficient amortized accesses.
</p>

<p>
Finally, AES is quite slow, and likely not the best encryption algorithm to use for hiding block data. We use it in our implementation because it is widely available in standard cryptography libraries, but to make this implementation practical, it should likely be exchanged for a faster encryption mechanism. We could also likely eliminate the setup cost by using decryption failures to mark initially empty blocks instead of explicitly encrypted null-address blocks.
</p>

<p>
Other than solving the limitations listed above, future work on this project could extend our library to include more data structures.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-06-22 Sun 20:08</p>
</div>
</body>
</html>
